-- -*- M2-comint -*- hash: 122784986
--loading configuration for package "FourTiTwo" from file /home/benjamin/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/benjamin/.Macaulay2/init-Topcom.m2

i1 : R=QQ[x_0..x_4];

i2 : F=face {x_0,x_2}

o2 = x  x  
      0  2

o2 : face with 2 vertices in R

i3 : I=monomialIdeal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0);

o3 : MonomialIdeal of R

i4 : D=simplicialComplex I

o4 = | x_2x_4 x_1x_4 x_1x_3 x_0x_3 x_0x_2 |

o4 : SimplicialComplex

i5 : fc=faces(1,D,useFaceClass=>true)

o5 = {x  x  , x  x  , x  x  , x  x  , x  x  }
       0  2    0  3    1  3    1  4    2  4

o5 : List

i6 : select(fc,j->j==F)

o6 = {x  x  }
       0  2

o6 : List

i7 : 
