-- -*- M2-comint -*- hash: 704817734
--loading configuration for package "FourTiTwo" from file /home/benjamin/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/benjamin/.Macaulay2/init-Topcom.m2

i1 : R = ZZ[a..d];

i2 : simplex = simplicialComplex{a*b*c*d}

o2 = | abcd |

o2 : SimplicialComplex

i3 : sphere = boundary simplex

o3 = | bcd acd abd abc |

o3 : SimplicialComplex

i4 : fVector sphere

o4 = HashTable{-1 => 1}
               0 => 4
               1 => 6
               2 => 4

o4 : HashTable

i5 : fVector simplex

o5 = HashTable{-1 => 1}
               0 => 4
               1 => 6
               2 => 4
               3 => 1

o5 : HashTable

i6 : R = ZZ[a..g];

i7 : D = simplicialComplex{a*b*c,a*d,d*f,g*c,e,f*g}

o7 = | fg cg df e ad abc |

o7 : SimplicialComplex

i8 : E = boundary D

o8 = | g f d bc ac ab |

o8 : SimplicialComplex

i9 : fVector D

o9 = HashTable{-1 => 1}
               0 => 7
               1 => 7
               2 => 1

o9 : HashTable

i10 : fVector E

o10 = HashTable{-1 => 1}
                0 => 6
                1 => 3

o10 : HashTable

i11 : 
