-- -*- M2-comint -*- hash: -102770528
--loading configuration for package "FourTiTwo" from file /home/benjamin/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/benjamin/.Macaulay2/init-Topcom.m2

i1 : R = ZZ[a..g];

i2 : bipyramid = simplicialComplex monomialIdeal(
           a*g, b*d, b*e, c*e, c*f, d*f)

o2 = | efg bfg deg cdg bcg aef abf ade acd abc |

o2 : SimplicialComplex

i3 : f = fVector bipyramid

o3 = HashTable{-1 => 1}
               0 => 7
               1 => 15
               2 => 10

o3 : HashTable

i4 : f#0

o4 = 7

i5 : f#1

o5 = 15

i6 : f#2

o6 = 10

i7 : void = simplicialComplex monomialIdeal 1_R

o7 = 0

o7 : SimplicialComplex

i8 : fVector void

o8 = HashTable{-1 => 0}

o8 : HashTable

i9 : S = ZZ[x_1..x_4, y_1..y_4, z_1..z_4];

i10 : I = monomialIdeal(x_1*x_2*x_3*x_4,
                 y_1*y_2*y_3*y_4,
                 z_1*z_2*z_3*z_4,
                 x_1*x_2*x_3*y_1*y_2*z_1,
                 x_1*y_1*y_2*y_3*z_1*z_2,
                 x_1*x_2*y_1*z_1*z_2*z_3);

o10 : MonomialIdeal of S

i11 : D = simplicialComplex I;

i12 : fVector D

o12 = HashTable{-1 => 1 }
                0 => 12
                1 => 66
                2 => 220
                3 => 492
                4 => 768
                5 => 837
                6 => 609
                7 => 264
                8 => 51

o12 : HashTable

i13 : grading = {{1,0,0},{1,0,0},{0,1,0},{0,1,0},{0,0,1},{0,0,1}};

i14 : S = ZZ[x_1..x_6, Degrees => grading];

i15 : I = monomialIdeal(x_1*x_2,x_3*x_4,x_5*x_6);

o15 : MonomialIdeal of S

i16 : fVector simplicialComplex I

o16 = HashTable{-1 => 1}
                0 => 6
                1 => 12
                2 => 8

o16 : HashTable

i17 : fVector(simplicialComplex I, Flag => true)

o17 = HashTable{{0, 0, 0} => 1}
                {0, 0, 1} => 2
                {0, 1, 0} => 2
                {0, 1, 1} => 4
                {1, 0, 0} => 2
                {1, 0, 1} => 4
                {1, 1, 0} => 4
                {1, 1, 1} => 8

o17 : HashTable

i18 : 
