-- -*- M2-comint -*- hash: -1064426054
--loading configuration for package "FourTiTwo" from file /home/benjamin/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/benjamin/.Macaulay2/init-Topcom.m2

i1 : R = QQ[a..d];

i2 : D = simplicialComplex monomialIdeal(a*b*c*d);

i3 : ring D

o3 = R

o3 : PolynomialRing

i4 : coefficientRing D

o4 = QQ

o4 : Ring

i5 : S = ZZ[w..z];

i6 : E = simplicialComplex monomialIdeal(w*x*y*z);

i7 : ring E

o7 = S

o7 : PolynomialRing

i8 : coefficientRing E

o8 = ZZ

o8 : Ring

i9 : 
