-- -*- M2-comint -*- hash: -1580271701
--loading configuration for package "FourTiTwo" from file /home/benjamin/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/benjamin/.Macaulay2/init-Topcom.m2

i1 : R = QQ[x_1..x_5];

i2 : bowtie = simplicialComplex {x_1*x_2*x_3,x_3*x_4*x_5}

o2 = | x_3x_4x_5 x_1x_2x_3 |

o2 : SimplicialComplex

i3 : star(bowtie,x_3)

o3 = | x_3x_4x_5 x_1x_2x_3 |

o3 : SimplicialComplex

i4 : star(bowtie,x_1*x_2)

o4 = | x_1x_2x_3 |

o4 : SimplicialComplex

i5 : R = QQ[a..e];

i6 : D = simplicialComplex {a*b*c*d, b*c*e, b*d*e, c*d*e}

o6 = | cde bde bce abcd |

o6 : SimplicialComplex

i7 : star(D,b*c*d)

o7 = | abcd |

o7 : SimplicialComplex

i8 : star(D,b)

o8 = | bde bce abcd |

o8 : SimplicialComplex

i9 : 
